nc: 3
end2end: True
reg_max: 16
scales:
  n: [0.5, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, ADown, [128]]
  - [-1, 2, C3k2, [256]]
  - [-1, 1, ADown, [256]]
  - [-1, 2, C3k2, [512]]
  - [-1, 1, ADown, [512]]
  - [-1, 2, C3k2, [1024]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 2, C2PSA, [1024]]

head:
  - [8, 1, Conv, [256, 1, 1]]
  - [4, 1, Conv, [128, 1, 1]]
  - [2, 1, Conv, [64, 1, 1]]
  - [9, 1, nn.Upsample, [None, 2, "bilinear"]]
  - [[10, 12], 1, Concat, [1]]
  - [13, 1, C3k2, [128]]
  - [14, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[11, 15], 1, Concat, [1]]
  - [16, 1, C3k2, [64]]
  - [17, 1, ADown, [64]]
  - [[14, 18], 1, Concat, [1]]
  - [19, 1, C3k2, [128]]
  - [20, 1, ADown, [128]]
  - [[9, 21], 1, Concat, [1]]
  - [22, 1, C3k2, [256]]
  - [[17, 20, 23], 1, Detect, [nc]]